import type { NextPage } from 'next'
import { ConditionerCard } from '../components/ConditionerCard'
import conditioners from '../public/conditioners.json'

const Index: NextPage = () => {
  return (
    <>
      <main className="flex flex-col gap-8 p-4 sm:py-8">
        <header className="flex items-center max-w-3xl justify-between mx-auto gap-4 w-full flex-wrap">
          <h1 className="text-sky-600 text-3xl font-extrabold font-alegreya">ДОБРЫЙ МАСТЕР</h1>
          <div className="flex items-center gap-4">
            <a className="text-sky-600 sm:text-xl flex items-center" href="tel:89785889023">
              <svg className="fill-current h-6 mr-2" viewBox="0 0 24 24">
                <path xmlns="http://www.w3.org/2000/svg" d="M5.481 1.992C5.39245 1.87809 5.28068 1.78433 5.15311 1.71694C5.02554 1.64955 4.88508 1.61007 4.74108 1.60113C4.59708 1.5922 4.45283 1.614 4.3179 1.6651C4.18297 1.71619 4.06046 1.79542 3.9585 1.8975L2.4075 3.45C1.683 4.176 1.416 5.2035 1.7325 6.105C3.04611 9.83638 5.18295 13.2241 7.9845 16.017C10.7774 18.8185 14.1651 20.9553 17.8965 22.269C18.798 22.5855 19.8255 22.3185 20.5515 21.594L22.1025 20.043C22.2046 19.941 22.2838 19.8185 22.3349 19.6836C22.386 19.5487 22.4078 19.4044 22.3989 19.2604C22.3899 19.1164 22.3505 18.976 22.2831 18.8484C22.2157 18.7208 22.1219 18.6091 22.008 18.5205L18.5475 15.8295C18.4258 15.7351 18.2843 15.6696 18.1336 15.6379C17.9829 15.6062 17.8269 15.6091 17.6775 15.6465L14.3925 16.467C13.954 16.5766 13.4946 16.5708 13.0591 16.4501C12.6235 16.3295 12.2266 16.0981 11.907 15.7785L8.223 12.093C7.90316 11.7736 7.67149 11.3767 7.55057 10.9411C7.42965 10.5056 7.4236 10.0461 7.533 9.6075L8.35501 6.3225C8.39237 6.17309 8.39531 6.01715 8.36361 5.86644C8.33191 5.71574 8.26639 5.57419 8.172 5.4525L5.481 1.992ZM2.826 0.7665C3.0885 0.503924 3.40385 0.300196 3.75111 0.168842C4.09838 0.0374881 4.46962 -0.0184849 4.84018 0.00463955C5.21074 0.027764 5.57213 0.129457 5.90038 0.302965C6.22862 0.476473 6.51619 0.717827 6.744 1.011L9.435 4.47C9.9285 5.1045 10.1025 5.931 9.9075 6.711L9.087 9.996C9.04458 10.1661 9.04687 10.3444 9.09366 10.5134C9.14044 10.6824 9.23013 10.8364 9.354 10.9605L13.0395 14.646C13.1638 14.7701 13.318 14.86 13.4873 14.9068C13.6566 14.9535 13.8351 14.9557 14.0055 14.913L17.289 14.0925C17.6739 13.9963 18.0757 13.9888 18.4639 14.0706C18.8522 14.1525 19.2167 14.3215 19.53 14.565L22.989 17.256C24.2325 18.2235 24.3465 20.061 23.2335 21.1725L21.6825 22.7235C20.5725 23.8335 18.9135 24.321 17.367 23.7765C13.4088 22.3838 9.81491 20.1178 6.852 17.1465C3.88094 14.184 1.61492 10.5907 0.222004 6.633C-0.320996 5.088 0.166505 3.4275 1.2765 2.3175L2.8275 0.7665H2.826Z" />
              </svg>+79785889023</a>
            <a className="text-sky-600 flex sm:text-xl items-center" href="https://goo.gl/maps/WvziutZzRBpFuzE68">
              <svg className="fill-current h-6 mr-2" viewBox="0 0 24 24">
                <path d="M18.249 13.41C17.463 15.003 16.398 16.59 15.309 18.015C14.2759 19.3584 13.1713 20.6453 12 21.87C10.8286 20.6453 9.72403 19.3584 8.691 18.015C7.602 16.59 6.537 15.003 5.751 13.41C4.956 11.8005 4.5 10.293 4.5 9C4.5 7.01088 5.29018 5.10322 6.6967 3.6967C8.10322 2.29018 10.0109 1.5 12 1.5C13.9891 1.5 15.8968 2.29018 17.3033 3.6967C18.7098 5.10322 19.5 7.01088 19.5 9C19.5 10.293 19.0425 11.8005 18.249 13.41ZM12 24C12 24 21 15.471 21 9C21 6.61305 20.0518 4.32387 18.364 2.63604C16.6761 0.948211 14.3869 0 12 0C9.61305 0 7.32387 0.948211 5.63604 2.63604C3.94821 4.32387 3 6.61305 3 9C3 15.471 12 24 12 24Z" />
                <path d="M12 12C11.2044 12 10.4413 11.6839 9.87868 11.1213C9.31607 10.5587 9 9.79565 9 9C9 8.20435 9.31607 7.44129 9.87868 6.87868C10.4413 6.31607 11.2044 6 12 6C12.7956 6 13.5587 6.31607 14.1213 6.87868C14.6839 7.44129 15 8.20435 15 9C15 9.79565 14.6839 10.5587 14.1213 11.1213C13.5587 11.6839 12.7956 12 12 12ZM12 13.5C13.1935 13.5 14.3381 13.0259 15.182 12.182C16.0259 11.3381 16.5 10.1935 16.5 9C16.5 7.80653 16.0259 6.66193 15.182 5.81802C14.3381 4.97411 13.1935 4.5 12 4.5C10.8065 4.5 9.66193 4.97411 8.81802 5.81802C7.97411 6.66193 7.5 7.80653 7.5 9C7.5 10.1935 7.97411 11.3381 8.81802 12.182C9.66193 13.0259 10.8065 13.5 12 13.5V13.5Z" />
              </svg>
              Севастополь, Новикова 3
            </a>
          </div>
        </header>
        <section className="flex gap-4 items-center w-full justify-between max-w-3xl mx-auto">
          <div className="flex flex-col gap-4">
            <h2 className="text-3xl font-medium w-80">Подбор, продажа, установка и обслуживание кондиционеров в Крыму</h2>
            <a className="bg-sky-600 rounded-lg px-4 py-2 text-center w-80 text-white" href="tel:89785889023">
              Позвонить
            </a>
          </div>
          <img className="hidden sm:block object-cover w-36 h-52" src="/logo.png" alt="Логотип - бегемот с разводным ключом" />
        </section>
        <p className="max-w-3xl sm:text-xl mx-auto">Компания &quot;Добрый Мастер&quot; предоставляет все услуги, связанные с кондиционерами. На сайте представлены популярные модели, среди которых можно сделать выбор, учитывая режим работы, площадь помещения и другие характеристики, после чего сделать заказ. Ассортимент, цены и наличие уточняйте по телефону.</p>
        <section className="flex gap-4 justify-center flex-col items-center">
          <h2 className="text-2xl font-medium">Каталог</h2>
          <div className="grid grid-cols-[repeat(auto-fit,minmax(320px,1fr))] w-full gap-4">
            {conditioners.map(conditioner => (
              <ConditionerCard conditioner={conditioner} key={conditioner.name} />
            ))}
          </div>
        </section>
      </main>
      <footer className="p-4 py-8 flex flex-col gap-4 items-center bg-black text-white">
        <p>© 2022 Добрый Мастер</p>
        <a href="https://pechk.in">
          <svg className="text-sky-600 fill-current h-6" viewBox="0 0 22 32" aria-label="pechk.in">
            <path d="M18 32C16.4489 32 15 30.7092 15 29V28C15 26.2908 16.4489 25 18 25H19C20.5511 25 22 26.2908 22 28V29C22 30.7092 20.5511 32 19 32H18Z"
              fill="currentColor" />
            <path fillRule="evenodd" clipRule="evenodd"
              d="M5.40851 0.664196C7.07721 0.221439 8.33156 0 10.4175 0C12.3843 0 13.8504 0.243906 15.4 0.75C16.9197 1.22442 17.9939 1.95627 19.0667 3C20.1394 4.04374 20.6292 4.96946 21.1954 6.67739C21.7318 8.35365 22 10.3779 22 12.75C22 16.7984 21.7301 19.7567 19.9421 21.8759C18.1542 23.9633 16.4799 25.4935 13.2318 25.4935C12.8742 25.4935 12.308 25.4619 11.5332 25.3987C10.7287 25.367 9.87939 25.1457 8.98543 24.7344C8.62192 24.5727 7.65527 23.9785 7.33333 23.7139V28.5C7.33333 30.3604 6.25152 31.8684 4.4 31.8684H2.93333C1.08181 31.8684 0 30.3604 0 28.5V7.16382C0 5.32934 0.491682 3.90607 1.47505 2.894C2.42858 1.85026 3.7398 1.10695 5.40851 0.664196ZM11.1103 8.42105C12.9619 8.42105 14.4627 9.92915 14.4627 11.7895V13.4737C14.4627 15.3341 12.9619 16.8421 11.1103 16.8421H10.831C8.97946 16.8421 7.4786 15.3341 7.4786 13.4737V11.7895C7.4786 9.92915 8.97946 8.42105 10.831 8.42105H11.1103Z"
              fill="currentColor" />
          </svg>
        </a>
      </footer>
    </>
  )
}

export default Index
